[
  {
    "category": "nature",
    "destination": "Balai Banahaw",
    "description": "Sampaloc Road",
    "link": "balai-banahaw",
    "preview": "/balai.jpg",
    "infoTitle": "Escape to the mist-filled mountains of Lucban, where Balai Banahaw blends serene nature, rustic farm life, and sweeping views of Mount Banahaw into an unforgettable retreat.",
    "infoDescription": "Balai Banahaw spans over 2.5 hectares of lush farmland, offering guests a peaceful refuge from the busy world. Wake up to cool mountain air, soft rolling fog, and the sound of birds echoing across the hills. Visitors can wander through landscaped gardens, unwind by the infinity-style pool, or interact with friendly farm animals. Charming cabanas, lotus ponds, and cozy nest hammocks create an atmosphere perfect for rest, reflection, and slow living. Whether you’re visiting with friends, family, or on a quiet getaway, Balai Banahaw captures the gentle beauty of rural Lucban.",
    "mapsEmbed": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3868.855367774003!2d121.58559787483685!3d14.144599388078676!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x33bd55bcbf3fa2b9%3A0x6a6ee4d02ead3ab2!2sBalai%20Banahaw%20Vacation%20Farm%20and%20Private%20Resort!5e0!3m2!1sen!2sph!4v1763799410612!5m2!1sen!2sph",
    "showcaseImages": []
  },
  {
    "category": "nature",
    "destination": "Charitos Eco-Farm",
    "description": "Sitio Kanluran, Brgy. Aliliw",
    "link": "charitos-ecofarm",
    "preview": "/charitos.jpg",
    "infoTitle": "A vibrant hillside escape where sustainable farming, refreshing mountain breezes, and relaxing rural living all come together in one picturesque destination.",
    "infoDescription": "Charitos Eco-Farm invites guests to breathe deeply and reconnect with the land. With rolling green landscapes as its backdrop, the farm features vegetable plots, fruit-bearing plants, and fresh produce grown the natural way. Guests can enjoy peaceful afternoons by the pool, rest in charming native cottages, or simply lounge in a hammock while watching the sunset brighten the hills. Ideal for travelers seeking calm, slow days, and an authentic farm-life experience, Charitos Eco-Farm delivers a refreshing break from city routines.",
    "mapsEmbed": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3868.8523353595738!2d121.54887757483698!3d14.144777588074454!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x33bd55671a821d79%3A0xc5d5a85991cba7a6!2sCharito's%20Ecofarm!5e0!3m2!1sen!2sph!4v1763799431001!5m2!1sen!2sph",
    "showcaseImages": []
  },
  {
    "category": "nature",
    "destination": "LK Farmcation",
    "description": "Lucban - Luisiana Road",
    "link": "lk-farmcation",
    "preview": "/lk.jpg",
    "infoTitle": "A warm and welcoming countryside haven where the quiet charm of farm life meets the comforts of a modern rural escape.",
    "infoDescription": "LK Farmcation offers a simple yet memorable retreat into the heart of Lucban’s countryside. Wake up to gentle breezes and open fields, perfect for morning strolls or peaceful reflection. Guests can interact with farm animals, enjoy the refreshing pool, or rest in thoughtfully designed cabins that blend comfort with rural warmth. Whether you’re staying for a quick escape or a slow weekend, LK Farmcation promises a relaxed, homey atmosphere ideal for families, friends, and anyone craving a genuine farmstay experience.",
    "mapsEmbed": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3868.868803185154!2d121.54056737795301!3d14.143809828965939!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x33bd55331423893d%3A0xa198534a15c57b2e!2sLinang%20ni%20LK%20-%20Lucban!5e0!3m2!1sen!2sph!4v1763799467897!5m2!1sen!2sph",
    "showcaseImages": []
  },
  {
    "category": "nature",
    "destination": "Lagaya Nature Farm",
    "description": "Sitio Kanluran, Brgy. Aliliw",
    "link": "lagaya-nature-farm",
    "preview": "/lagaya.jpg",
    "infoTitle": "A lush nature sanctuary where vibrant gardens, rolling hills, and peaceful farm landscapes inspire calm, discovery, and connection with the outdoors.",
    "infoDescription": "Lagaya Nature Farm is an inviting escape for nature lovers and quiet adventurers. Wander through blooming flower gardens, explore vegetable patches, or take serene walks along tree-lined paths. The property offers scenic corners perfect for reflection, picnics, or simply taking in the beauty of the surrounding greenery. Whether you’re here to unwind, explore, or reconnect with nature, Lagaya Nature Farm provides a refreshing pause from everyday life.",
    "mapsEmbed": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3868.828350399679!2d121.54780207483685!3d14.146186988040984!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x33bd556f7fbd3805%3A0x67191524a65387bf!2sLagaya%20Nature%20Farm!5e0!3m2!1sen!2sph!4v1763799482913!5m2!1sen!2sph",
    "showcaseImages": []
  },
  {
    "category": "nature",
    "destination": "Bukid Amara",
    "description": "Sitio Aramin, Brgy. Malupak",
    "link": "bukid-amara",
    "preview": "/bukid.jpg",
    "infoTitle": "A hilltop oasis offering panoramic views, crisp mountain air, and the timeless charm of rural Lucban.",
    "infoDescription": "Bukid Amara sits high above the countryside, giving guests clear views of rolling hills, farmlands, and distant mountains. The cool climate and open spaces make it perfect for sunrise watching, afternoon lounging, or peaceful evening conversations under the stars. Guests can explore scenic trails, enjoy farm-to-table meals, or stay in cozy native cottages designed to complement the landscape. Bukid Amara is a calming retreat for travelers seeking scenic beauty and quiet moments away from the noise.",
    "mapsEmbed": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3869.4836704478885!2d121.5779440748363!3d14.107629588956318!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x33bd5354851c73a5%3A0x432b940a8ee06056!2sBukid%20Amara!5e0!3m2!1sen!2sph!4v1763799497833!5m2!1sen!2sph",
    "showcaseImages": []
  },
  {
    "category": "nature",
    "destination": "Bantayog Farm",
    "description": "Brgy. Piis, Sampaloc Road",
    "link": "bantayog-farm",
    "preview": "/bantayog.jpg",
    "infoTitle": "A peaceful rural escape surrounded by open fields, thriving vegetation, and the authentic simplicity of farm life.",
    "infoDescription": "Bantayog Farm offers visitors a chance to slow down and embrace nature’s calm. Explore orchards, walk through wide green spaces, or spend time with the friendly farm animals that bring life to the property. The rustic accommodations and open-air gathering spots create a relaxed, welcoming atmosphere perfect for families, couples, or solo explorers. Whether you’re here for rest or gentle adventure, Bantayog Farm captures the charm of Lucban’s countryside.",
    "mapsEmbed": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3868.786634671734!2d121.5911717781958!3d14.14863795264493!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x33bd55362f754ea7%3A0x434ca058096592f2!2sBantayog%20Farm!5e0!3m2!1sen!2sph!4v1763799515874!5m2!1sen!2sph",
    "showcaseImages": []
  },
  {
    "category": "faith",
    "destination": "Kamay Ni Hesus Healing Church",
    "description": "Lucban-Tayabas Road",
    "link": "kamay-ni-hesus",
    "preview": "/kamaynihesus.jpg",
    "infoTitle": "A beloved pilgrimage site nestled in Lucban’s highlands, offering spiritual renewal, peaceful gardens, and awe-inspiring hilltop views.",
    "infoDescription": "Kamay Ni Hesus Healing Church draws pilgrims and travelers seeking inspiration, healing, and connection. The sprawling grounds feature serene gardens, devotional areas, and striking religious monuments. Visitors can climb the steps to the Risen Christ statue for panoramic views overlooking Lucban, join prayer and healing services, or simply enjoy the calm and reflective atmosphere. The site beautifully blends nature, devotion, and cultural tradition, making it one of Lucban’s most iconic destinations.",
    "mapsEmbed": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3869.591246906136!2d121.5702925748363!3d14.101290189106647!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x33bd539acad2aa6d%3A0xda6e5069650f0133!2sKamay%20Ni%20Hesus%20Healing%20Church!5e0!3m2!1sen!2sph!4v1763799532126!5m2!1sen!2sph",
    "showcaseImages": []
  },
  {
    "category": "faith",
    "destination": "St. Louis Bishop Parish Church",
    "description": "La Purisima Concepcion St., Poblacion",
    "link": "san-obispo",
    "preview": "/church.jpg",
    "infoTitle": "A historic Spanish-era church at the heart of Lucban, echoing centuries of faith, architectural beauty, and cultural heritage.",
    "infoDescription": "Lucban Church stands as a proud symbol of the town’s deep-rooted history and devotion. With its weathered stone walls, intricate details, and serene interiors, the church invites visitors to pause, reflect, and appreciate its timeless charm. Surrounding it is a lively plaza where locals gather, festivals unfold, and traditions continue to thrive. Whether you’re here for prayer, history, or cultural immersion, Lucban Church offers a meaningful glimpse into the town’s past and present.",
    "mapsEmbed": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3869.3640800205726!2d121.55105667483635!3d14.114673688789285!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x33bd53f61b9879d3%3A0x9b7acaa7d0246c2e!2sSaint%20Louis%20Bishop%20Parish%20Church!5e0!3m2!1sen!2sph!4v1763799553576!5m2!1sen!2sph",
    "showcaseImages": []
  }
]
